#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2023/8/17 13:44
# @Author  : lemondyoung
# @File    : constants.py
# @Description: 常量文件

# 传统色
nature_color = list('红黄蓝绿紫金银黑白灰')
"""
红： 代表红色，是喜庆、热情、繁荣的象征。
白： 代表白色，通常象征纯洁、清新、无暇。
黑： 代表黑色，常用于表示深沉、神秘、庄重。
黄： 代表黄色，通常象征光明、希望、富贵。
绿： 代表绿色，通常象征生机、健康、和平。
蓝： 代表蓝色，常用于表示宁静、清澈、深邃。
紫： 代表紫色，通常象征高贵、神秘、尊荣。
金： 代表金色，通常象征富贵、权力、荣耀。
银： 代表银色，常用于表示高贵、华丽、珍贵。
青： 代表青色，通常象征青春、希望、活力。
"""

# 衍生色
derivative_color = list('青粉素朱赤丹棕褐绯染')
"""
青： 与蓝绿色相关，也有年轻、清新的联想。
绯： 联想到红色，也带有浓郁、鲜艳的情感。
朱： 暗示红色，但也与红色相关的情感、氛围有关。
丹： 暗示红色，也有美好、高贵等情感联想。
赤： 联想到红色、火焰，可能有热情、能量的意味。
素： 虽然与白色相关，但更强调朴素、纯净的意味。
棕： 象征着土地、稳重，可能与棕色等相关的实在和平和情感有关。
褐： 象征着土壤、朴实，可能与褐色等相关的朴实和稳定情感有关。
染： 联想到色彩、染色，有涂抹、变化的意味。
"""

# 代表植物的颜色
plant_color = list('竹荷茶苏麦玫瑰枫棉柳茉艾莲柠檬')
"""
麦： 象征着麦田、丰收，可能与麦色等相关的丰饶和美好情感有关。
玫： 象征着玫瑰花的颜色，可能与玫瑰色等相关的浪漫和温柔情感有关。
枫： 象征着枫叶、秋天，可能与枫色等相关的温暖和变幻情感有关。
棉： 象征着棉花的颜色，可能与棉色等相关的柔和和舒适情感有关。
柳： 象征着柳树、柔软，可能与柳色等相关的温和和生机情感有关。
茉： 象征着茉莉花的颜色，可能与茉莉色等相关的芳香和温柔情感有关。
艾： 象征着艾草、清香，可能与艾色等相关的清新和舒适情感有关。
"""

# 代表物品的颜色
stuff_color = list('雪奶琉玉')
"""
琉： 联想到琉璃的颜色，也许能够唤起光彩、透明感。
玉： 像玉石一样的高贵、洁白，可能与绿色、白色等相关的清雅和高贵情感有关。
雪： 象征着雪白、纯洁，可能与雪色等相关的洁净和纯真情感有关。
奶： 象征着乳白色，可能与奶色等相关的纯真和宁静情感有关。
"""

# 天气的形容词
climate_adj = list('郎清翠碧悠清晴熏密弥漫')
"""
朗： 联想到明亮、清澈，与白色或光线有关。
翠： 联想到翠绿的颜色，可以用于描绘自然的生机与美丽。
碧： 像碧绿的颜色，可能与绿色、蓝色等相关的清新和生机情感有关。
悠： 暗示悠长、宁静，可以形容心情或时光。
晴： 暗示晴朗的天气，也可借喻清澈、明亮的心情。
清： 表达清新、纯净，可以用于描绘感觉和情绪。
"""

# 代表水果的颜色
fruit_color = list('栗柿杏桃橙柚荔莓芒枣橘橄')
"""
橙： 象征着活力、温暖，可能与橙色等相关的积极和光明情感有关。
杏： 象征着杏黄色，可能与杏色等相关的柔和和温暖情感有关。
柚： 象征着柚子的颜色，可能与柚色等相关的明亮和活力情感有关。
橄： 象征着橄榄色，可能与橄榄色等相关的自然和健康情感有关。
桃： 象征着桃色、温柔，可能与桃色等相关的柔美和甜蜜情感有关。
"""

# 表示天气的物体
climate_stuff = list('晨风露云')
"""
晨： 暗示早晨的宁静、清新，可以用于描绘景色或心情。
云： 象征着自由、变化，可以用于形容天空或心情。
风： 象征着飘逸、轻盈，也可以描述风景和感受。
露： 暗示水珠、露水的清凉感觉，也可以象征着暴露、流露等。
"""

# 表示自然的物体
nature_stuff = list('木森林')
"""
"""

# 表示动物的物体
animal_stuff = list('象马龙鹅鱼兔猫狗鸟鼠')
"""
龙： 象征着神秘、力量，可能用于描绘壮观的地方或场景。
鸟： 通常用于象征自由、轻盈，可以用于描绘美好的景象。
鱼： 象征着富裕、生育，可能用于与水有关的地名。
兔： 象征着敏捷、聪明，可能用于描绘生机和灵动。
猫： 象征着柔美、神秘，可能用于强调灵性和优雅。
狗： 象征着忠诚、友善，可能用于表达忠实和热情。
"""

# 表示文化的物体
culture_stuff = list('梦舞音影琴棋书画')
"""
梦： 象征着梦幻、希望，可以用于表达美好的愿景。
舞： 联想到舞蹈、欢乐，可以用于描述欢愉的场景。
音： 暗示声音、音乐，也可以象征情感和共鸣。
影： 联想到影子、倩影，适合形容映照和隐喻。
画： 联想到绘画、美景，适合用来描述美丽的事物。
"""

# 场所地方
site_place = ['公园', '广场', '乐园', '社区']

# 区域地方
region_place = ['县', '市', '州', '省']

# print(list(vars().keys()))